List meals = [
  {
    "title": "1 فواكه",
    "subcategoryList": [
      {
        "subtitle": "1الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "2الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "3الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "4الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "5الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "6الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      }
    ],
  },
  {
    "title": "2 فواكه",
    "subcategoryList": [
      {
        "subtitle": "1الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "2الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "3الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "4الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "5الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "6الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      }
    ],
  },
  {
    "title": "3 فواكه",
    "subcategoryList": [
      {
        "subtitle": "1الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "2الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "3الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "4الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "5الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "6الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      }
    ],
  },
  {
    "title": "4 فواكه",
    "subcategoryList": [
      {
        "subtitle": "1الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "2الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "3الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "4الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "5الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "6الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      }
    ],
  },
  {
    "title": "5 فواكه",
    "subcategoryList": [
      {
        "subtitle": "1الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "2الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "3الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "4الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "5الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "6الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      }
    ],
  },
  {
    "title": "6 فواكه",
    "subcategoryList": [
      {
        "subtitle": "1الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "2الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "3الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "4الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "5الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "6الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      }
    ],
  },
  {
    "title": "7 فواكه",
    "subcategoryList": [
      {
        "subtitle": "1الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "2الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "3الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "4الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "5الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      },
      {
        "subtitle": "6الجمعة",
        "productList": [
          {
            "name": "1سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "2سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "3سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "4سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "5سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "6سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "7سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          },
          {
            "name": "8سلطة كاري مع صوص التوت ",
            "image": "",
            "subname": "سعرات حرارية"
          }
        ]
      }
    ],
  }
];
