Repository: AbirAhsan/barbell_sample
Catalog: lib/l10n/app_*.arb
Languages: ar

# homeTitle
source: Home Screen
ar: الشاشة الرئيسية

# buttonName
source: Next Screen
ar: الشاشة التالية

# buttonDescription
source: To View Details Go to Next Screen
ar: لعرض التفاصيل ، انتقل إلى الشاشة التالية

# productScreenTitle
source: Meals
ar: الوجبات

# searchIcon
source: something pampering what you need
ar: امر تدلل وش تحتاج

# dropdownButton
source: food elements
ar: عناصر غذائية

# profileTitle
source: Profile Screen
ar: حساب تعريفي

# name
source: Abdul Rahman Al Obaid
ar: عبدالرحمن العبيد

# gender
source: Male
ar: ذكر

source: Weight
ar: الوزن

source: Height
ar: الطول

source: Age
ar: العمر

# mobile
source: Mobile Number
ar: رقم الجوال

# anualPackage
source: Annual Package
ar: الباقة السنوية

source: Start Date
ar: تاريخ بداية الاشتراك

source: End Date
ar: تاريخ انتهاء الاشتراك

source: Common Goal
ar: هدف المشترك

source: Over Weight
ar: زيادة الوزن

source: Weight Loss
ar: نزول الوزن

source: Weight Stability
ar: ثبات الوزن

source: Exercize Location
ar: مكان التمرين

source: Home
ar: في البيت

source: Gym
ar: في الجيم

source: Schedule
ar: جدول التمارين

source: Eating Table
ar: جدول الأكل
